Revit 2027 API
FabricationPart.ProductMaterialDescription Property
 The product material description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductMaterialDescription { get; }
Public ReadOnly Property ProductMaterialDescription As String
	Get
public:
property String^ ProductMaterialDescription {
	String^ get ();
}
member ProductMaterialDescription : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace